package techlead

import org.apache.poi.ss.usermodel.Row
import org.apache.poi.xssf.streaming.SXSSFWorkbook
import org.apache.poi.xssf.usermodel.XSSFWorkbook
import java.io.File
import java.io.FileInputStream
import java.io.FileOutputStream
import java.util.*


fun main() {
    readXlsx()

//    val stack = Stack<Pair<Int, String>>()
//    map.forEach { it -> // first, second ->
//        if (it.first.length != 2) {
//            while (stack.isNotEmpty() && stack.peek().first >= level(it.second))
//                stack.pop()
//
//            if (stack.isEmpty())
//                stack.push(level(it.second) to it.second)
//            else
//                stack.push(level(it.second) to stack.peek().second + "\n" + it.second)
//
//            if (it.first != "I" &&  it.first != "")
//                println("${it.first} -> \n${stack.peek().second}")
//        }
//        println(it.second)
//    }
}

fun level(str: String): Int {
    return str.count { it == '—' }
}

fun readXlsx() {
    val myFile = File("C:\\Users\\kmax\\Downloads\\для Максима Новый ТНВЭД (1).xlsx")
    val fis = FileInputStream(myFile)
    val myWorkBook = XSSFWorkbook(fis)
    val mySheet = myWorkBook.getSheetAt(0)
    val rowIterator: Iterator<Row> = mySheet.iterator()

    // write
    val excelFileName = "C:\\Users\\kmax\\Downloads\\ТНВЭД result 2.xlsx" //name of excel file
    val sheetName = "Sheet1" //name of sheet
    val wb = SXSSFWorkbook()
    wb.setCompressTempFiles(true);
    val sheet = wb.createSheet(sheetName)
    var rownum = 0

    val stack = Stack<Pair<Int, String>>()
    while (rowIterator.hasNext()) {
        val row = rowIterator.next()
        val first = row.getCell(0)?.getStringCellValue() ?: ""
        println(first)
        val second = row.getCell(1)?.getStringCellValue() ?: ""
        if (first.length != 2) {
            while (stack.isNotEmpty() && stack.peek().first >= level(second.takeWhile { it == '—' || it == ' ' }))
                stack.pop()

            if (stack.isEmpty())
                stack.push(level(second.takeWhile { it == '—' || it == ' ' }) to second)
            else
                stack.push(level(second.takeWhile { it == '—' || it == ' ' }) to stack.peek().second + "\n" + second)

            var cellNum = 0
            if (first != "I" && first != "") {
//                println("${first} -> \n${stack.peek().second}")
                val row = sheet.createRow(rownum++)
                val cell = row.createCell(cellNum++)
                cell.setCellValue(first)
                val cell2 = row.createCell(cellNum++)
                cell2.setCellValue(stack.peek().second)
            }
        }
    }
    val fileOut = FileOutputStream(excelFileName)
    wb.write(fileOut)
    fileOut.close()
    wb.dispose()
}

val map = listOf<Pair<String, String>>(

);

val map3 = listOf(
    "01" to "ЖИВЫЕ ЖИВОТНЫЕ",
    "0101" to "Лошади, ослы, мулы и лошаки живые:",
    "I" to "— лошади:",
    "0101 21 000 0" to "— — чистопородные племенные животные",
    "0101 29" to "— — прочие:",
    "0101 29 100 0" to "— — — убойные",
    "0101 29 900 0" to "— — — прочие",
    "0101 30 000 0" to "— ослы",
    "0101 90 000 0" to "— прочие",
    "0102" to "Крупный рогатый скот живой:",
    "I" to "— домашний крупный рогатый скот:",
    "0102 21" to "— — чистопородные племенные животные:",
    "0102 21 100 0" to "— — — нетели (самки крупного рогатого скота до первого отела)",
    "0102 21 300 0" to "— — — коровы",
    "0102 21 900 0" to "— — — прочие",
    "0102 29" to "— — прочие:",
    "0102 29 050 0" to "— — — подрода Bibos или подрода Poephagus",
    "I" to "— — — прочие:",
    "0102 29 100 0" to "— — — — массой не более 80 кг",
    "I" to "— — — — массой более 80 кг, но не более 160 кг:",
    "0102 29 210 0" to "— — — — — убойные",
    "0102 29 290 0" to "— — — — — прочие",
    "I" to "— — — — массой более 160 кг, но не более 300 кг:",
    "0102 29 410 0" to "— — — — — убойные",
    "0102 29 490 0" to "— — — — — прочие",
    "I" to "— — — — массой более 300 кг:",
    "I" to "— — — — — нетели (самки крупного рогатого скота до первого отела):",
    "0102 29 510 0" to "— — — — — — убойные",
    "0102 29 590 0" to "— — — — — — прочие",
    "I" to "— — — — — коровы:",
    "0102 29 610 0" to "— — — — — — убойные",
    "0102 29 690 0" to "— — — — — — прочие",
    "I" to "— — — — — прочие:",
    "0102 29 910 0" to "— — — — — — убойные",
    "0102 29 990 0" to "— — — — — — прочие",
    "I" to "— буйволы:",
    "0102 31 000 0" to "— — чистопородные племенные животные",
    "0102 39" to "— — прочие:",
    "0102 39 100 0" to "— — — домашние виды",
    "0102 39 900 0" to "— — — прочие",
    "0102 90" to "— прочие:",
    "0102 90 200 0" to "— — чистопородные племенные животные",
    "I" to "— — прочие:",
    "0102 90 910 0" to "— — — домашние виды",
    "0102 90 990 0" to "— — — прочие",
    "0103" to "Свиньи живые:",
    "0103 10 000 0" to "— чистопородные племенные животные",
    "I" to "— прочие:",
    "0103 91" to "— — массой менее 50 кг:",
    "0103 91 100 0" to "— — — домашние виды",
    "0103 91 900 0" to "— — — прочие",
    "0103 92" to "— — массой 50 кг или более:",
    "I" to "— — — домашние виды:",
    "0103 92 110 0" to "— — — — свиноматки массой не менее 160 кг, имевшие по крайней мере один опорос",
    "0103 92 190 0" to "— — — — прочие",
    "0103 92 900 0" to "— — — прочие",
    "0104" to "Овцы и козы живые:",
    "0104 10" to "— овцы:",
    "0104 10 100 0" to "— — чистопородные племенные животные",
    "I" to "— — прочие:",
    "0104 10 300 0" to "— — — ягнята (до одного года)",
    "0104 10 800 0" to "— — — прочие",
    "0104 20" to "— козы:",
    "0104 20 100 0" to "— — чистопородные племенные животные",
    "0104 20 900 0" to "— — прочие",
    "0105" to "Домашняя птица живая, то есть куры домашние (Gallus domesticus), утки, гуси, индейки и цесарки:",
    "I" to "— массой не более 185 г:",
    "0105 11" to "— — куры домашние (Gallus domesticus):",
    "I" to "— — — цыплята прародительских и материнских линий племенного разведения:",
    "0105 11 110 0" to "— — — — линии несушек",
    "0105 11 190 0" to "— — — — прочие",
    "I" to "— — — прочие:",
    "0105 11 910 0" to "— — — — линии несушек",
    "0105 11 990 0" to "— — — — прочие",
    "0105 12 000 0" to "— — индейки",
    "0105 13 000 0" to "— — утки",
    "0105 14 000 0" to "— — гуси",
    "0105 15 000 0" to "— — цесарки",
    "I" to "— прочие:",
    "0105 94 000 0" to "— — куры домашние (Gallus domesticus)",
    "0105 99" to "— — прочие:",
    "0105 99 100 0" to "— — — утки",
    "0105 99 200 0" to "— — — гуси",
    "0105 99 300 0" to "— — — индейки",
    "0105 99 500 0" to "— — — цесарки",
    "0106" to "Живые животные прочие:",
    "I" to "— млекопитающие:",
    "0106 11 00" to "— — приматы:",
    "0106 11 001 0" to "— — — для научно-исследовательских целей",
    "0106 11 009 0" to "— — — прочие",
    "0106 12 00" to "— — киты, дельфины и морские свиньи (млекопитающие отряда Cetacea); ламантины и дюгони (млекопитающие отряда Sirenia); тюлени, морские львы и моржи (млекопитающие подотряда Pinnipedia):",
    "0106 12 001 0" to "— — — для научно-исследовательских целей",
    "0106 12 009 0" to "— — — прочие",
    "0106 13 00" to "— — верблюды и прочие животные семейства верблюдовых (Camelidae):",
    "0106 13 001 0" to "— — — для научно-исследовательских целей",
    "0106 13 009 0" to "— — — прочие",
    "0106 14" to "— — кролики и зайцы:",
    "0106 14 10" to "— — — кролики домашние:",
    "0106 14 101 0" to "— — — — для научно-исследовательских целей",
    "0106 14 109 0" to "— — — — прочие",
    "0106 14 90" to "— — — прочие:",
    "0106 14 901 0" to "— — — — для научно-исследовательских целей",
    "0106 14 909 0" to "— — — — прочие",
    "0106 19 00" to "— — прочие:",
    "0106 19 001 0" to "— — — для научно-исследовательских целей",
    "0106 19 009" to "— — — прочие:",
    "0106 19 009 1" to "— — — — лисицы",
    "0106 19 009 2" to "— — — — песцы",
    "0106 19 009 3" to "— — — — соболи",
    "0106 19 009 4" to "— — — — норки",
    "0106 19 009 9" to "— — — — прочие",
    "0106 20 00" to "— рептилии (включая змей и черепах):",
    "0106 20 001 0" to "— — для научно-исследовательских целей",
    "0106 20 009 0" to "— — прочие",
    "I" to "— птицы:",
    "0106 31 00" to "— — хищные птицы:",
    "0106 31 001 0" to "— — — для научно-исследовательских целей",
    "0106 31 009 0" to "— — — прочие",
    "0106 32 00" to "— — попугаеобразные (включая попугаев, длиннохвостых попугаев, ара и какаду):",
    "0106 32 001 0" to "— — — для научно-исследовательских целей",
    "0106 32 009 0" to "— — — прочие",
    "0106 33 00" to "— — страусы; эму (Dromaius novaehollandiae):",
    "0106 33 001 0" to "— — — для научно-исследовательских целей",
    "0106 33 009 0" to "— — — прочие",
    "0106 39" to "— — прочие:",
    "0106 39 100 0" to "— — — голуби",
    "0106 39 80" to "— — — прочие:",
    "0106 39 801 0" to "— — — — для научно-исследовательских целей",
    "0106 39 809 0" to "— — — — прочие",
    "I" to "— насекомые:",
    "0106 41 000" to "— — пчелы:",
    "I" to "— — — медоносные:",
    "0106 41 000 1" to "— — — — матки пчелиные",
    "0106 41 000 2" to "— — — — пчелопакеты",
    "0106 41 000 3" to "— — — — прочие",
    "I" to "— — — прочие:",
    "0106 41 000 8" to "— — — — для научно-исследовательских целей",
    "0106 41 000 9" to "— — — — прочие",
    "0106 49 000" to "— — прочие:",
    "0106 49 000 1" to "— — — для научно-исследовательских целей",
    "0106 49 000 9" to "— — — прочие",
    "0106 90 00" to "— прочие:",
    "0106 90 001 0" to "— — животные для научно-исследовательских целей",
    "0106 90 009 0" to "— — прочие",

//    "01" to "ЖИВЫЕ ЖИВОТНЫЕ",
//    "0101" to "Лошади, ослы, мулы и лошаки живые:",
//    "I" to "— лошади:",
//    "0101 21 000 0" to "— — чистопородные племенные животные",
//    "0101 29" to "— — прочие:",
//    "0101 29 100 0" to "— — — убойные",
//    "0101 29 900 0" to "— — — прочие",
//    "0101 30 000 0" to "— ослы",
//    "0101 90 000 0" to "— прочие",
//    "0102" to "Крупный рогатый скот живой:",
//    "I" to "— домашний крупный рогатый скот:",
//    "0102 21" to "— — чистопородные племенные животные:",
//    "0102 21 100 0" to "— — — нетели (самки крупного рогатого скота до первого отела)",
//    "0102 21 300 0" to "— — — коровы",
//    "0102 21 900 0" to "— — — прочие",
//    "0102 29" to "— — прочие:",
//    "0102 29 050 0" to "— — — подрода Bibos или подрода Poephagus",
//    "I" to "— — — прочие:",
//    "0102 29 100 0" to "— — — — массой не более 80 кг",
//    "I" to "— — — — массой более 80 кг, но не более 160 кг:",
//    "0102 29 210 0" to "— — — — — убойные",
//    "0102 29 290 0" to "— — — — — прочие",
//    "I" to "— — — — массой более 160 кг, но не более 300 кг:",
//    "0102 29 410 0" to "— — — — — убойные",
//    "0102 29 490 0" to "— — — — — прочие",
//    "I" to "— — — — массой более 300 кг:",
//    "I" to "— — — — — нетели (самки крупного рогатого скота до первого отела):",
//    "0102 29 510 0" to "— — — — — — убойные",
)